<template>
    <div>
        <h1 class="flex justify-center mb-5 text-[32px]">Q & A</h1>
        <div class="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 lg:grid-cols-4 gap-4">
            <CardBoxQandA v-for="(item, index) in items" :key="index" :title="item.title"
                :description="item.description" :subtitle="item.subtitle" />
        </div>
    </div>
</template>

<script setup>
import CardBoxQandA from './qanda/cardboxqa.vue'

const items = [
    {
        title: 'HOW ABOUT SHARK?', subtitle: "ฉลามจะกัดเรามั้ย", description: `จะเจอฉลามสักตัวไม่ใช่เรื่องง่ายนัก เพราะสมัย
        นี้หายากเหลือเกินฉลามจะกินอาหารที่ขนาดเล็ก กว่าตัวมันประมาณ 3-4 เท่า และมนุษย์ไม่ใช่ อาหารของฉลามฉลามพันธุ์บางสายพันธุ์เท่า
        นั้นที่จะจู่โจมคนนั้น ส่วนใหญ่เกิดจากความ
        เข้าใจผิด ส่วนใหญ่อาศัยในน้ำเย็น ส่วนใหญ่
        ที่พบเจอจะเป็น Reef Shark ฉลามประเภท
        นี้กลัวคนมาก ถ้าเราเข้าไปใกล้นิดเดียว เค้าก็จะว่ายหนีไป` },
    {
        title: 'HOW DEEP?', subtitle: "ดำกันลึกแค่ไหน", description: `สำหรับการคอร์สดำน้ำเบื้องต้น Open Water นั้น ผู้เรียนจะลงไปลึกไม่เกิน 12 เมตร ในสองไดฟ์ แรก และ ไม่เกิน 18 เมตรในสอง ไดฟ์ต่อมา เมื่อจบคอร์สดำน้ำเบื้องต้นแล้ว คอร์ส Advanced Open Water จะพาคุณไป สัมผัสกับระดับที่ลึกขึ้นได้ถึง 40 เมตร แต่โดย
        ปกติที่เราดำน้ำเที่ยวกันเฉลี่ยจะอยู่ที่ประมาณ
        ไม่เกิน 18-25 เมตร` 
    },
    { title: 'SHORTSIGHTED DIVERS?', subtitle: "สายตาสั้นดำน้ำได้มั้ย", description: `สายตาสั้นก็ดำน้ำได้ นักดำน้ำสามารถใส่
Contact Lens ได้ หรือ ใส่ MASK ที่เปลี่ยน เลนส์สายตาได้การหักเหของแสงจะทำให้เรา
เห็นวัตถุใกล้กว่า 25% และขยายใหญ่กว่า 33% อีกด้วย` },
    { title: 'HOW OLD DIVER ?', subtitle: "อายุเท่าไหร่ถึงดำน้ำได้", description: `สามารถเรียนดำน้ำได้ตั้งแต่ 10 ปีขึ้นไป ถึงอายุ เท่าไหร่ก็ได้ถ้าร่างกายแข็งแรง เริ่มเรียน เมื่ออายุ 8-10 ปี ดำน้ำได้ในสระเท่านั้น เริ่ม เรียนเมื่ออายุ 10 ปีขึ้นไป เรียนดำน้ำได้ปกติ
* มีจำกัดความลึกบางช่วงอายุ เริ่มเรียนเมื่อ อายุ 45 ปีขึ้นไป ต้องมีแพทย์เซ็นต์รับรอง Fit for diving แต่เมื่อดำน้ำเป็นแล้ว สามารถ ใช้บัตรดำ น้ำได้ตลอดชีพไม่มีหมดอายุ` },
    { title: 'Buddy?', subtitle: "", description: `เรียนดำน้ำคนเดียวได้ แต่เราไม่ดำน้ำคน
เดียวแน่ ดังนั้นไม่ต้องกังวล มีนักดำน้ำนวน มากที่มาเรียนคนเดียว แล้วมีเพื่อนใหม่จาก
การดำน้ำ เป็นแกงค์ใหม่เลยทีเดียว บางคนก็ พบรักจากการดำน้ำด้วยนะ` },
]
</script>